Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The target thread should check this variable regularly, and return from its run method in an orderly fashion if the variable indicates that it is to stop running.
zh_cn: 目标线程应定期检查此变量，如果变量指示要停止运行，则应按顺序从其 run 方法返回。

source: The text range begins at the specified beginIndex and extends to the char at index endIndex - 1.
zh_cn: 文本范围始于指定的 beginIndex，并扩展到索引 endIndex - 1 上的 char。

source: The thread T is then removed from the wait set for this object and re-enabled for thread scheduling.
zh_cn: 此方法导致当前线程（称之为 T）将其自身放置在对象的等待集中，然后放弃此对象上的所有同步要求。

source: The thread ID is a positive long number generated when this thread was created.
zh_cn: 线程 ID 是创建此线程时生成的正 long 数字。

source: The thread ID is unique and remains unchanged during its lifetime.
zh_cn: 线程 ID 是唯一的，在其生存期内保持不变。

source: The thread does not lose ownership of any monitors.
zh_cn: 该线程不丢失任何监视器的所属权。

source: The thread groups form a tree in which every thread group except the initial thread group has a parent.
zh_cn: 线程组构成一棵树，在树中，除了初始线程组外，每个线程组都有一个父线程组。

source: The thread has completed execution.
zh_cn: 线程已经结束执行。

source: The thread releases ownership of this monitor and waits until another thread notifies threads waiting on this object's monitor to wake up either through a call to the notify method or the notifyAll method.
zh_cn: 该线程发布对此监视器的所有权并等待，直到其他线程通过调用 notify 方法，或 notifyAll 方法通知在此对象的监视器上等待的线程醒来。

source: The thread releases ownership of this monitor and waits until either of the following two conditions has occurred:
zh_cn: 该线程发布对此监视器的所有权，并等待下面两个条件之一发生：

source: The thread then waits until it can re-obtain ownership of the monitor and resumes execution.
zh_cn: 然后，该线程等到重新获得对监视器的所有权后才能继续执行。

source: The timeout period, specified by timeout milliseconds plus nanos nanoseconds arguments, has elapsed.
zh_cn: timeout 毫秒值与 nanos 毫微秒参数值之和指定的超时时间已用完。

source: The total number of characters to be copied is srcEnd-srcBegin.
zh_cn: 要复制的字符总数为 srcEnd-srcBegin。

source: The type of the entity requesting authentication.
zh_cn: 请求验证的实体的类型。

source: The unqualified name of a proxy class is unspecified.
zh_cn: 未指定代理类的非限定名称。

source: The use and transitions among plain vs tree modes is complicated by the existence of subclass LinkedHashMap.
zh_cn: 由于存在子类 LinkedHashMap，在普通模式和树模式之间的使用和转换变得复杂了。

source: The use of this queue interacts with pool sizing:
zh_cn: 可以使用此队列与池大小进行交互：

source: The value is automatically wrapped in an object if it has a primitive type.
zh_cn: 如果该值是一个基本类型值，则自动将其包装在一个对象中。

source: The value must be greater than 2 and should be at least 8 to mesh with assumptions in tree removal about conversion back to plain bins upon shrinkage.
zh_cn: 该值必须大于 2，并且应该至少为 8，以便满足在收缩时移除树转换回普通 bin 的假设。

source: The value of @Repeatable indicates the containing annotation type for the repeatable annotation type.
zh_cn: 值 @Repeatable 表示包含 containing annotation type (包含的注释类型) 是可重复注释类型。

source: The values for the constants representing the modifiers are taken from the tables in sections 4.1, 4.4, 4.5, and 4.7 of The Java™ Virtual Machine Specification.
zh_cn: 表示修饰符的常量值取自于 The Java™ Virtual Machine Specification 的表 4.1、4.4、4.5 和 4.7。

source: The version specification is described by the following formal grammar:
zh_cn: 版本规范是由下列形式的语法描述的：

source: The virtual machine's built-in class loader, called the "bootstrap class loader", does not itself have a parent but may serve as the parent of a ClassLoader instance.
zh_cn: 虚拟机的内置类加载器（称为 "bootstrap class loader"）本身没有父类加载器，但是可以将它用作 ClassLoader 实例的父类加载器。

source: The working directory does not exist.
zh_cn: 工作目录不存在。

source: The wrapper classes Boolean, Character, Integer, Long, Float, and Double serve this purpose.
zh_cn: 包装器类 Boolean、Character、Integer、Long、Float 和 Double 就是用于这个目的。

source: Then the character at index k in the new character sequence is equal to the character at index k in the old character sequence, if k is less than n; otherwise, it is equal to the character at index k-n in the argument sb.
zh_cn: 如果 k 小于 n，则新字符序列中索引 k 处的字符等于原序列中索引 k 处的字符；否则它等于参数 sb 中索引 k-n 处的字符。

source: Then the character at index k in the new character sequence is equal to the character at index k in the old character sequence, if k is less than n; otherwise, it is equal to the character at index k-n in the argument str.
zh_cn: 如果 k 小于 n，则新字符序列中索引 k 处的字符等于原序列中索引 k 处的字符；否则它等于参数 str 中索引 k-n 处的字符。

source: Then the character at index k in this character sequence becomes equal to the character at index k in this sequence, if k is less than n; otherwise, it is equal to the character at index k+start-n in the argument s.
zh_cn: 如果 k 小于 n，则新字符序列中索引 k 处的字符等于原序列中索引 k 处的字符；否则它等于参数 s 中索引 k+start-n 处的字符。

source: Then the character at index k in the new character sequence is equal to the character at index n-k-1 in the old character sequence.
zh_cn: 则新字符序列中索引 k 处的字符将等于原字符序列索引 n-k-1 处的字符。

source: There are several restrictions on the parameters that may be passed to Proxy.getProxyClass:
zh_cn: 对可以传递给 Proxy.getProxyClass 的参数有以下几个限制：

source: There are three general strategies for queuing:
zh_cn: 排队有三种通用策略：

source: There are two ways to create a new thread of execution.
zh_cn: 创建新执行线程有两种方法。

source: There is a buffer class for each non-boolean primitive type.
zh_cn: 每个非布尔基本类型都有一个缓冲区类。

source: There is a tradeoff between speed, utility, and quality of bit-spreading.
zh_cn: 这是在速度，效用和比特传播质量之间进行的权衡。

source: There is no requirement that a process represented by a Process object execute asynchronously or concurrently with respect to the Java process that owns the Process object.
zh_cn: 对于带有 Process 对象的 Java 进程，没有必要异步或并发执行由 Process 对象表示的进程。

source: Therefore application developers may take advantage of any number of provider-based implementations without having to add or rewrite code.
zh_cn: 因此，应用程序开发人员可以利用任何数量的基于提供商的实现而不必添加或重写代码。

source: Therefore soft and weak references need not be registered with a queue in order to be useful, while phantom references do.
zh_cn: 所以，软引用和弱引用不需要向队列注册即可使用，而虚引用则需要这样做。

source: Therefore, it is not possible to clone an object merely by virtue of the fact that it implements this interface.
zh_cn: 因此，因为某个对象实现了此接口就克隆它是不可能的。

source: Therefore, it would be wrong to write a program that depended on this exception for its correctness: the fail-fast behavior of iterators should be used only to detect bugs.
zh_cn: 因此，编写依赖于此异常的程序的做法是错误的，正确做法是：迭代器的快速失败行为应该仅用于检测程序错误。

source: Therefore, most methods with more than 0.5 ulp errors are required to be semi-monotonic: whenever the mathematical function is non-decreasing, so is the floating-point approximation, likewise, whenever the mathematical function is non-increasing, so is the floating-point approximation.
zh_cn: 因此，大多数误差大于 0.5 ulp 的方法都要求是半单调的：只要数学函数是非递减的，浮点近似值就是非递减的；同样，只要数学函数是非递增的，浮点近似值就是非递增的。

source: Therefore, when a duplicate method is invoked on a proxy instance, the Method object for the method in the foremost interface that contains the method (either directly or inherited through a superinterface) in the proxy class's list of interfaces is passed to the invocation handler's invoke method, regardless of the reference type through which the method invocation occurred.
zh_cn: 因此，在代理实例上调用重复方法时，第一个接口中的方法的 Method 对象包含接口的代理类列表中的方法（直接或通过超级接口继承），该对象会传递到调用处理程序的 invoke 方法，无论该方法调用通过哪一种引用类型发生。

source: These algorithms are available from the well-known network library netlib as the package "Freely Distributable Math Library," fdlibm.
zh_cn: 这些算法可以从众所周知的网络库 netlib 以 fdlibm（“Freely Distributable Math Library，免费发布的数学库”）包的形式获得。

source: These algorithms, which are written in the C programming language, are then to be understood as executed with all floating-point operations following the rules of Java floating-point arithmetic.
zh_cn: 这些算法都是用 C 编程语言编写的，在使用所有遵循 Java 浮点算法规则的浮点运算执行时也能够被理解。

source: These are mainly of use in atomic data structures in which several volatile fields of the same node (for example, the links of a tree node) are independently subject to atomic updates.
zh_cn: 它们主要用于原子数据结构中，该结构中同一节点（例如，树节点的链接）的几个 volatile 字段都独立受原子更新控制。

source: These are similar in usage to the implicit monitors accessed using Object.wait, but offer extended capabilities.
zh_cn: 这些变量在用法上与使用 Object.wait 访问的隐式监视器类似，但提供了更强大的功能。

source: These can be used to manipulate the execution environment; for example, reinitializing ThreadLocals, gathering statistics, or adding log entries.
zh_cn: 它们可用于操纵执行环境；例如，重新初始化 ThreadLocal、搜集统计信息或添加日志条目。

source: These classes also provide a number of methods for converting among primitive values, as well as supporting such standard methods as equals and hashCode.
zh_cn: 这些类还提供了大量用于转换基值的方法，并支持一些标准方法，比如 equals 和 hashCode。

source: These classes are also notable in providing volatile access semantics for their array elements, which is not supported for ordinary arrays.
zh_cn: 这些类在为其数组元素提供 volatile 访问语义方面也引人注目，这对于普通数组来说是不受支持的。

source: These classes are capable of formatting dates, numbers, and messages, parsing; searching and sorting strings; and iterating over characters, words, sentences, and line breaks.
zh_cn: 这些类能够格式化日期、数字和消息、解析、搜索和排序字符串，以及迭代字符、单词、语句和换行符。

source: These classes employ a work-stealing scheduler that attains high throughput for tasks conforming to restrictions that often hold in computation-intensive parallel processing.
zh_cn: 这些类使用一个工作窃取调度程序，该调度程序可以为符合计算密集型并行处理中经常存在的限制的任务获得高吞吐量。

source: These classes enable greater flexibility in how and when to use atomic updates, at the expense of more awkward reflection-based setup, less convenient usage, and weaker guarantees.
zh_cn: 这些类在如何以及何时使用原子更新方面具有更大的灵活性，但相应的弊端是基于映射的设置较为拙笨、使用不太方便，而且在保证方面也较差。

source: These constants are used with the Target meta-annotation type to specify where it is legal to use an annotation type.
zh_cn: 这些常量与 Target 元注释类型一起使用，以指定在什么情况下使用注释类型是合法的。

source: These include raw types, parameterized types, array types, type variables and primitive types.
zh_cn: 它们包括原始类型、参数化类型、数组类型、类型变量和基本类型。

source: These include:
zh_cn: 这种情况包括：

source: These mappings will replace any mappings that this map had for any of the keys currently in the specified map.
zh_cn: 这些映射关系将替换此映射目前针对指定映射中所有键的所有映射关系。

source: These methods are also used when serializing HashSets
zh_cn: 序列化哈希集时也使用这些方法。

source: These modifications will be visible to subprocesses started via the start() method.
zh_cn: 对于通过 start() 方法启动的子进程，这些修改是可见的。

source: These states are virtual machine states which do not reflect any operating system thread states.
zh_cn: 这些状态是虚拟机状态，它们并没有反映所有操作系统线程状态。

source: These variables differ from their normal counterparts in that each thread that accesses one (via its get or set method) has its own, independently initialized copy of the variable.
zh_cn: 这些变量不同于它们的普通对应物，因为访问某个变量（通过其 get 或 set 方法）的每个线程都有自己的局部变量，它独立于变量的初始化副本。

source: They also support several features not found in the other buffer classes:
zh_cn: 它们还支持其他缓冲区类所没有的几个特性：

source: They are operationally defined as follows:
zh_cn: 在操作上，可将它们定义如下：

source: They are used in conjunction with the Retention meta-annotation type to specify how long annotations are to be retained.
zh_cn: 它们与 Retention 元注释类型一起使用，以指定保留多长的注释。

source: They do not define methods such as equals, hashCode and compareTo.
zh_cn: 它们不 定义诸如 equals，hashCode 和 compareTo 之类的方法。

source: They treat char values from the surrogate ranges as undefined characters.
zh_cn: 它们将代理项字符范围内的 char 值视为未定义字符。

source: This String is then returned.
zh_cn: 然后返回此 String。

source: This API includes a framework whereby different drivers can be installed dynamically to access different data sources.
zh_cn: 此 API 包括一个框架，凭借此框架可以动态地安装不同驱动程序来访问不同数据源。

source: This Certificate interface is entirely deprecated and is here to allow for a smooth transition to the new package.
zh_cn: 此 Certificate 接口已完全废弃，其仍存在是为了能平稳地过渡到新包。

source: This MessageDigest class provides applications the functionality of a message digest algorithm, such as SHA-1 or SHA-256.
zh_cn: 此 MessageDigest 类为应用程序提供信息摘要算法的功能，如 SHA-1 或 SHA-256 算法。

source: This abstract class is the superclass of all classes representing an input stream of bytes.
zh_cn: 此抽象类是表示字节输入流的所有类的超类。

source: This abstract class is the superclass of all classes representing an output stream of bytes.
zh_cn: 此抽象类是表示输出字节流的所有类的超类。

source: This abstract class will delegate most of the work to the underlying protocol handlers like http or ftp.
zh_cn: 此抽象类将大多数工作委托给底层协议处理程序，如 http 或 ftp。

source: This allows an extensible number to be used to represent major, minor, micro, etc. versions.
zh_cn: 这允许使用可扩展的编号来表示主版本号、次版本号、缩微版本号，等等。

source: This allows the flexibility of adding localizations for new localizations at any time.
zh_cn: 这实现了随时为新本地化添加本地化的灵活性。

source: This can occur if this type represents a non-parameterized type nested within a parameterized type.
zh_cn: 如果此类型表示嵌套在参数化类型中的非参数化类型，则会发生这种情况。

source: This class centralizes all security properties and common security methods.
zh_cn: 此类集中了所有的安全属性和常见的安全方法。

source: This class consists exclusively of static methods that operate on or return collections.
zh_cn: 此类完全由在 collection 上进行操作或返回 collection 的静态方法组成。

source: This class consists of static utility methods for operating on objects.
zh_cn: 这个类包含 static 实用方法。

source: This class contains various methods for manipulating arrays (such as sorting and searching).
zh_cn: 此类包含用来操作数组（比如排序和搜索）的各种方法。

source: This class defines the Service Provider Interface (SPI) for the AlgorithmParameterGenerator class, which is used to generate a set of parameters to be used with a certain algorithm.
zh_cn: 此类为 AlgorithmParameterGenerator 类定义 服务提供者接口 (SPI)，AlgorithmParameterGenerator 类用于生成在某个特定算法中使用的参数集合。

source: This class defines the Service Provider Interface (SPI) for the AlgorithmParameters class, which is used to manage algorithm parameters.
zh_cn: 此类为 AlgorithmParameters 类定义 服务提供者接口 (SPI)，AlgorithmParameters 类用于管理算法参数。

source: This class defines the Service Provider Interface (SPI) for the KeyFactory class.
zh_cn: 此类为 KeyFactory 类定义 服务提供者接口 (SPI)。

source: This class defines the Service Provider Interface (SPI) for the KeyPairGenerator class, which is used to generate pairs of public and private keys.
zh_cn: 此类为用来生成公钥和私钥的 KeyPairGenerator 类定义了 服务提供者接口 (SPI)。

source: This class defines the Service Provider Interface (SPI) for the KeyStore class.
zh_cn: 此类为 KeyStore 类定义 服务提供者接口 (SPI)。

source: This class defines the Service Provider Interface (SPI) for the MessageDigest class, which provides the functionality of a message digest algorithm, such as MD5 or SHA.
zh_cn: 此类为 MessageDigest 类定义 服务提供者接口 (SPI)，MessageDigest 类提供信息摘要算法的功能，如 MD5 或 SHA。

source: This class defines the Service Provider Interface (SPI) for the Policy class.
zh_cn: 此类为 Policy 类定义 服务提供者接口 (SPI)。

source: This class defines the Service Provider Interface (SPI) for the SecureRandom class.
zh_cn: 此类为 SecureRandom 类定义了 服务提供者接口 (SPI)。

source: This class defines the Service Provider Interface (SPI) for the Signature class, which is used to provide the functionality of a digital signature algorithm.
zh_cn: 此类为 Signature 类定义了 服务提供者接口 (SPI)，可用来提供数字签名算法功能。

source: This class defines the operations common to all reference objects.
zh_cn: 此类定义了常用于所有引用对象的操作。

source: This class does not properly convert characters into bytes.
zh_cn: 此类未能正确地将字符转换为字节。

source: This class encapsulates information about a code signer.
zh_cn: 此类扩展 codebase 的概念，不仅可以封装位置 (URL) 而且可以封装用于验证起源于该位置的签名代码的证书链。

source: This class encapsulates information about a signed timestamp.
zh_cn: 此类封装有关签署时间戳的信息。

source: This class extends ThreadLocal to provide inheritance of values from parent thread to child thread: when a child thread is created, the child receives initial values for all inheritable thread-local variables for which the parent has values.
zh_cn: 该类扩展了 ThreadLocal，为子线程提供从父线程那里继承的值：在创建子线程时，子线程会接收所有可继承的线程局部变量的初始值，以获得父线程所具有的值。

source: This class extends ClassLoader with additional support for defining classes with an associated code source and permissions which are retrieved by the system policy by default.
zh_cn: 此类扩展了 ClassLoader，使它另外还支持使用相关的代码源和权限定义类，这些代码源和权限默认情况下可根据系统策略获取到。

source: This class implements a character buffer that can be used as a character-input stream.
zh_cn: 此类实现一个可用作字符输入流的字符缓冲区。

source: This class implements a character buffer that can be used as an Writer.
zh_cn: 此类实现一个可用作 Writer 的字符缓冲区。

source: This class implements a hash table, which maps keys to values.
zh_cn: 此类实现一个哈希表，该哈希表将键映射到相应的值。

source: This class implements a vector of bits that grows as needed.
zh_cn: 此类实现了一个按需增长的位向量。

source: This class implements an IP Socket Address (IP address + port number) It can also be a pair (hostname + port number), in which case an attempt will be made to resolve the hostname.
zh_cn: 此类实现 IP 套接字地址（IP 地址 + 端口号），它也可以是一对(主机名+端口号)，在这种情况下，将尝试解析主机名。。

source: This class implements an output stream in which the data is written into a byte array.
zh_cn: 此类实现了一个输出流，其中的数据被写入一个 byte 数组。

source: This class implements client sockets (also called just "sockets").
zh_cn: 此类实现客户端套接字（也可以就叫“套接字”）。

source: This class implements server sockets.
zh_cn: 此类实现服务器套接字。

source: This class implements the Map interface with a hash table, using reference-equality in place of object-equality when comparing keys (and values).
zh_cn: 此类利用哈希表实现 Map 接口，比较键（和值）时使用引用相等性代替对象相等性。

source: This class implements the Set interface, backed by a hash table (actually a HashMap instance).
zh_cn: 此类实现 Set 接口，由哈希表（实际上是一个 HashMap 实例）支持。

source: This class implements the Unicode Bidirectional Algorithm.
zh_cn: 此类实现了 Unicode 双向算法 (Unicode Bidirectional Algorithm)。

source: This class incorrectly assumes that bytes adequately represent characters.
zh_cn: 此类错误假定字节能充分表示字符。

source: This class is a member of the Java Collections Framework.
zh_cn: 此类是 Java Collections Framework 的成员。

source: This class is a simple holder for a key pair (a public key and a private key).
zh_cn: 此类是简单的密钥对（公钥和私钥）持有者。

source: This class is designed for use as a drop-in replacement for StringBuffer in places where the string buffer was being used by a single thread (as is generally the case).
zh_cn: 该类被设计用作 StringBuffer 的一个简易替换，用在字符串缓冲区被单个线程使用的时候（这种情况很普遍）。

source: This class is no longer used.
zh_cn: 将不再使用此类。

source: This class is the superclass of all classes that filter output streams.
zh_cn: 此类是过滤输出流的所有类的超类。

source: This class is used as an opaque representation of cryptographic parameters.
zh_cn: 此类用作密码参数的不透明表示形式。

source: This class is used to create operating system processes.
zh_cn: 此类用于创建操作系统进程。

source: This class loader is used to load classes and resources from a search path of URLs referring to both JAR files and directories.
zh_cn: 该类加载器用于从指向 JAR 文件和目录的 URL 的搜索路径加载类和资源。

source: This class makes no guarantees as to the order of the map; in particular, it does not guarantee that the order will remain constant over time.
zh_cn: 此类不保证映射的顺序，特别是它不保证该顺序恒久不变。

source: This class provides protected overridable beforeExecute(Thread, Runnable) and afterExecute(Runnable, Throwable) methods that are called before and after execution of each task.
zh_cn: 此类提供 protected 可重写的 beforeExecute(Thread, Runnable) 和 afterExecute(Runnable, Throwable) 方法，这两种方法分别在执行每个任务之前和之后调用。

source: This class provides a cryptographically strong random number generator (RNG).
zh_cn: 此类提供强加密随机数生成器 (RNG)。

source: This class provides a skeletal implementation of the List interface to minimize the effort required to implement this interface backed by a "random access" data store (such as an array).
zh_cn: 此类提供 List 接口的骨干实现，以最大限度地减少实现“随机访问”数据存储（如数组）支持的该接口所需的工作。

source: This class provides a skeletal implementation of the Collection interface, to minimize the effort required to implement this interface.
zh_cn: 此类提供 Collection 接口的骨干实现，以最大限度地减少了实现此接口所需的工作。

source: This class provides a skeletal implementation of the List interface to minimize the effort required to implement this interface backed by a "sequential access" data store (such as a linked list).
zh_cn: 此类提供了 List 接口的骨干实现，从而最大限度地减少了实现受“连续访问”数据存储（如链接列表）支持的此接口所需的工作。

source: This class provides a skeletal implementation of the Map interface, to minimize the effort required to implement this interface.
zh_cn: 此类提供 Map 接口的骨干实现，以最大限度地减少实现此接口所需的工作。

source: This class provides a skeletal implementation of the Set interface to minimize the effort required to implement this interface.
zh_cn: 此类提供 Set 接口的骨干实现，从而最大限度地减少了实现此接口所需的工作。

source: This class provides an API compatible with StringBuffer, but with no guarantee of synchronization.
zh_cn: 此类提供一个与 StringBuffer 兼容的 API，但不保证同步。

source: This class provides skeletal implementations of some Queue operations.
zh_cn: 此类提供某些 Queue 操作的骨干实现。

source: This class provides the method normalize which transforms Unicode text into an equivalent composed or decomposed form, allowing for easier sorting and searching of text.
zh_cn: 此类提供 normalize 方法，它把 Unicode 文本转换为等效的组合或分解形式，允许对文本进行更方便地分类和搜索。

source: This class provides thread-local variables.
zh_cn: 该类提供了线程局部 (thread-local) 变量。

source: This class represents a "provider" for the Java Security API, where a provider implements some or all parts of Java Security.
zh_cn: 此类表示 Java 安全 API "provider"，这里 provider 实现了 Java 安全性的一部分或者全部。

source: This class represents a Network Interface address.
zh_cn: 此类表示网络接口地址。

source: This class represents a Network Interface made up of a name, and a list of IP addresses assigned to this interface.
zh_cn: 此类表示一个由名称和分配给此接口的 IP 地址列表组成的网络接口。

source: This class represents a Socket Address with no protocol attachment.
zh_cn: 此类表示不带任何协议附件的 Socket Address。

source: This class represents a datagram packet.
zh_cn: 此类表示数据报包。

source: This class represents a proxy setting, typically a type (http, socks) and a socket address.
zh_cn: 此类表示代理设置，通常为类型（http、socks）和套接字地址。

source: This class represents a socket for sending and receiving datagram packets.
zh_cn: 此类表示用来发送和接收数据报包的套接字。

source: This class represents a storage facility for cryptographic keys and certificates.
zh_cn: 此类表示密钥和证书的存储设施。

source: This class represents an Internet Protocol (IP) address.
zh_cn: 此类表示互联网协议 (IP) 地址。

source: This class represents an Internet Protocol version 4 (IPv4) address.
zh_cn: 此类表示 Internet Protocol version 4 (IPv4) 地址。

source: This class represents an Internet Protocol version 6 (IPv6) address.
zh_cn: 此类表示互联网协议第 6 版 (IPv6) 地址。

source: This class represents an observable object, or "data" in the model-view paradigm.
zh_cn: 此类表示模型视图范例中的 observable 对象，或者说“数据”。

source: This class represents the set of symbols (such as the decimal separator, the grouping separator, and so on) needed by DecimalFormat to format numbers.
zh_cn: 此类表示了 DecimalFormat 格式化数字所需的符号集（如小数点、组分隔符等等）。

source: This constructor does not make a copy of the command list.
zh_cn: 此构造方法不会 制作一份 command 列表的副本。

source: This constructor has the same effect as Thread (group, null, name).
zh_cn: 这种构造方法与 Thread (group, null, name) 同样的效果。

source: This constructor has the same effect as Thread (group, target, gname) ,where gname is a newly generated name.
zh_cn: 这种构造方法与 Thread (group, target, gname) 具有相同的作用，其中 gname 是一个新生成的名称。

source: This constructor has the same effect as Thread (null, null, gname), where gname is a newly generated name.
zh_cn: 这种构造方法与 Thread (null, null, gname) 具有相同的作用，其中 gname 是一个新生成的名称。

source: This constructor has the same effect as Thread (null, null, name).
zh_cn: 这种构造方法与 Thread (null, null, name) 同样的效果。

source: This constructor has the same effect as Thread (null, target, gname), where gname is a newly generated name.
zh_cn: 这种构造方法与 Thread (null, target, gname) 具有相同的作用，其中 gname 是一个新生成的名称。

source: This constructor has the same effect as Thread (null, target, name).
zh_cn: 这种构造方法与 Thread (null, target, name) 同样的效果。

source: This constructor was deprecated in API level 1.
zh_cn: 此构造函数在 API 级别 1 中已弃用。
